In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('Data.csv')

In [5]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [10]:
X = data.iloc[:,0:-1]
y = data.iloc[:,-1]

In [12]:
from sklearn.impute import SimpleImputer

In [14]:
si = SimpleImputer(strategy='mean',missing_values=np.nan)

In [25]:
si.fit(X.iloc[:,1:3])
X.iloc[:,1:3] = si.transform(X.iloc[:,1:3])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  10 non-null     object
 1   Age      10 non-null     float64
 2   Salary   10 non-null     float64
dtypes: float64(2), object(1)
memory usage: 372.0+ bytes